Revit 2024 API
FabricationNetworkChangeService.ChangeService Method (ISet<ElementId>, Int32, Int32)
 Changes the service of the selection of fabrication parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public FabricationNetworkChangeServiceResult ChangeService(
	ISet<ElementId> selection,
	int serviceId,
	int paletteId
)
Visual Basic
Public Function ChangeService ( _
	selection As ISet(Of ElementId), _
	serviceId As Integer, _
	paletteId As Integer _
) As FabricationNetworkChangeServiceResult
Visual C++
public:
FabricationNetworkChangeServiceResult ChangeService(
	ISet<ElementId^>^ selection,
	int serviceId,
	int paletteId
)
Parameters
selection
Type: System.Collections.Generic.ISet<ElementId>
 The set of element identifiers of fabrication parts to change the service for.
serviceId
Type: System.Int32
 The identifier of the fabrication service.
paletteId
Type: System.Int32
 The identifier of the fabrication palette.
Remarks
 After this method has been invoked, call:
GetStraightsThatWereNotChanged() to get a set of fabrication part straight element identifiers that were not changed.
GetElementsThatFailed() to get a set of fabrication part element identifiers that had failures.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The selection contains invalid elements to change.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  No fabrication configuration is loaded.
See Also
FabricationNetworkChangeService Class
ChangeService Overload
Autodesk.Revit.DB.Fabrication Namespace